# 04. Securing the Control Plane and Data Plane on Cisco Routers

## Lab Setup

![Lab topology](../../../.gitbook/assets/securing-control-plane-and-data-plane-on-cisco-routers.png)



**Router1:**
```
Router#
Router#conf t
Router(config)#hostname Router1
Router1(config)#int g0/1
Router1(config-if)#ip add 12.12.12.1 255.255.255.0
Router1(config-if)#no shut
Router1(config-if)#int lo1
Router1(config-if)#ip add 1.1.1.1 255.255.255.255
Router1(config-if)#no shut
Router1(config-if)#do wr
```

**Router2:**
```
Router#conf t
Router(config)#hostname Router2
Router2(config)#int g0/1
Router2(config-if)#ip add 12.12.12.2 255.255.255.0
Router2(config-if)#no shut
Router2(config-if)#int lo1
Router2(config-if)#ip add 2.2.2.2 255.255.255.255
Router2(config-if)#no sh
Router2(config-if)#int g0/2
Router2(config-if)#ip add 23.23.23.2 255.255.255.0
Router2(config-if)#no shut
Router2(config-if)#do wr
```

**Router3:**
```
Router#conf t
Router(config)#hostname Router3
Router3(config)#int g0/1
Router3(config-if)#ip add 23.23.23.1 255.255.255.0
Router3(config-if)#no shut
Router3(config-if)#int lo1
Router3(config-if)#ip add 3.3.3.3 255.255.255.255
Router3(config-if)#no shut
Router3(config-if)#do wr
```

## Securing EIGRP

### Securing the Control Plane

* Use MD5 hash of a passcode/key
* Prevents rogue router from injecting
* EIGRP malicious routes
* Authentication Create passcode inside of keychain
* Reference keychain on interfaces participating in EIGRP

### Other Routing Protocols

* RIP
  *  Authentication key configured inside of keychain
* OSPF
  * Authentication key configured on interface
* BGP
  * Authentication key configured in BGP configuration mode

### Configuration Steps

* Configure EIGRP
* Create keychain
* Reference keychain on interfaces

**Router1:**
```
Router1(config)#router eigrp 100
Router1(config-router)#network 12.12.12.0 0.0.0.255
Router1(config-router)#network 1.1.1.0 0.0.0.255
Router1(config-router)#passive-interface default
Router1(config-router)#no passive-interface gi 0/1
Router1(config-router)#exit
Router1(config)#key chain GloboRoutingKeys
Router1(config-keychain)#key 1
Router1(config-keychain-key)#key-string Globo123
Router1(config-keychain-key)#exit
Router1(config-keychain)#exit
Router1(config-if)#ip authentication key
Router1(config-if)#ip authentication key-chain eigrp 100 GloboRoutingKeys
Router1(config-if)#ip authentication mode eigrp 100 md5
Router1(config-if)#do show run section key
  key chain GloboRoutingKeys
    key 1
      key-string Globo123
    ip authentication key-chain eigrp 100 GloboRoutingKeys
Router1(config-if)#exit
Router1(config)#service password
Router1(config)#service password-encryption
Router1(config)#do show run section key
  key chain GloboRoutingKeys
    key 1
      key-string 7 1535070306257A767B
    ip authentication key-chain eigrp 100 GloboRoutingKeys
```

**Router 2:**
```
Router2(config)#service password-encryption
Router2(config)#router eigrp 100
Router2(config-router)#passive-interface default
Router2(config-router)#no passive-interface gi 0/1
Router2(config-router)#no passive-interface gi 0/2
Router2(config-router)#network 23.23.23.0 0.0.0.255
Router2(config-router)#network 2.2.2.0 0.0.0.255
Router2(config-router)#network 12.12.12.0 0.0.0.255
Router2(config-router)#key chain GloboRoutingKeys
Router2(config-keychain)#key 1
Router2(config-keychain-key)#key-string Globo123
Router2(config-keychain-key)#exit
Router2(config-keychain)#exit
Router2(config-if)#ip authentication key-chain eigrp 100 GloboRoutingKeys
Router2(config-if)#ip authentication mode eigrp 100 md5
```

**Router 3:**
```
Router3(config)#router eigrp 100
Router3(config-router)#passive
Router3(config-router)#passive-interface default
Router3(config-router)#no passive-int
Router3(config-router)#no passive-interface gi 0/1
Router3(config-router)#network 3.3.3.0 0.0.0.255
Router3(config-router)#network 23.23.23.0 0.0.0.255
```

**EIGRP Debug:**
```
# We see that router 1 is ignoring the packets until auth configured
*Dec 4 19:04:41.469 EIGRP: Gi0/1: ignored packet from 12.12.12.1, opcode = 5 (authentication off or key-chain missing)
# We see the adjacency forms when auth is configured
*Dec 4 19:07:33.818: %DUAL-5-NBRCHANGE: EIGRP-IPv4 100: Neighbor 12.12.12.1 (GigabitEthernet0/1) is up: new adjacency

### show ip route on Router3
Router3(config-router)#do show ip route
Codes:  L local, C - connected, S static, R - RIP ,  M mobile, B - BGP
        D - EIGRP , EX EIGRP external, 0 OSPF. IA OSPF inter area
        N1 OSPF NSSA external type 1, N2 OSPF NSSA external type 2
        E1 OSPF external type 1, E2 OSPF external type 2
        i. IS-IS, su - IS-IS summary, L1 IS-IS level-1, L2 - IS-IS level-2
        ia IS-IS inter area, candidate default, U - per-user static route
        o - ODR, P periodic downloaded static route, H NHRP , 1 LISP
        a application route
        + replicated route, % - next hop override, overrides from PfR

Gateway of last resort is not set

  1.0.0.0/24 is subnetted, 1 subnets
D   1.1.1.0 [90/131072] via 23.23.23.2, 00:00:11. GigabitEthernet0/1
  2.0.0.0/24 is subnetted, 1 subnets
D   2.2.2.0 [90/130816] via 23.23.23.2, 00:00:11, GigabitEthernet0/1
  3.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C   3.3.3.0/24 is directly connected, Loopback3
L   3.3.3.3/32 is directly connected, Loopback3
  12.0.0.0/24 is subnetted, 1 subnets
S   12.12.12.0 [1/0] via 23.23.23.2
  23.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C   23.23.23.0/24 is directly connected, GigabitEthernet0/1
L   23.23.23.3/32 is directly connected, GigabitEthernet0/1

### ping 1.1.1.1 from 3.3.3.3
Router3(config-router)#do ping 1.1.1.1 source 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
Packet sent with a source address of 3.3.3.3
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/5/8 ms
```
